dev/vllm/benchmarks/phase0/20260224-185458/rate-2.0.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0cea3a4220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase0/20260224-185458', result_filename='rate-2.0.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-d781b315-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [02:36<00:00,  1.91it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  156.68    
Total input tokens:                      62238     
Total generated tokens:                  59669     
Request throughput (req/s):              1.91      
Output token throughput (tok/s):         380.83    
Peak output token throughput (tok/s):    716.00    
Peak concurrent requests:                19.00     
Total token throughput (tok/s):          778.06    
---------------Time to First Token----------------
Mean TTFT (ms):                          60.33     
Median TTFT (ms):                        60.15     
P50 TTFT (ms):                           60.15     
P95 TTFT (ms):                           72.80     
P99 TTFT (ms):                           75.02     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.88     
Median TPOT (ms):                        20.84     
P50 TPOT (ms):                           20.84     
P95 TPOT (ms):                           21.43     
P99 TPOT (ms):                           22.02     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.86     
Median ITL (ms):                         20.70     
P50 ITL (ms):                            20.70     
P95 ITL (ms):                            21.48     
P99 ITL (ms):                            27.65     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4188.63   
Median E2EL (ms):                        3089.54   
P50 E2EL (ms):                           3089.54   
P95 E2EL (ms):                           12165.94  
P99 E2EL (ms):                           15963.73  
==================================================